#ตัวดำเนินการเปรียบเทียบ 
# คือการนำข้อมูลอย่างน้อยสองค่ามาเปรียบเทียบกัน
# ข้อมูลที่นำมาเปรียบเทียบจะต้องเป็นชนิดเดียวกัน
# คำตอบจะมีสองคำตอบคือ True and false
# แบบ 1 ('ค่า x มากกว่า y หรือไม่? : ', x>y)
# แบบ 2 ('ค่า x น้อยกว่า y หรือไม่? : ', x<y)
# แบบ 3 ('ค่า x เท่ากับ y หรือไม่? : ', x==y)
# แบบ 4('ค่า x ไม่เท่ากับ y หรือไม่? : ', x!=y)

x,y,z = 8,7,9

print('ค่า x มากกว่า y หรือไม่? : ', x>y)
print('ค่า x น้อยกว่า y หรือไม่? : ', x<y)
print('ค่า x เท่ากับ y หรือไม่? : ', x==y)
print('ค่า x ไม่เท่ากับ y หรือไม่? : ', x!=y)

print('ค่า x มากกว่า หรือ เท่ากับ y หรือไม่? : ', x>=y)
print('ค่า x น้อยกว่า หรือ เท่ากับ y หรือไม่? : ', x<=y)

print('ค่า x มากกว่า y และ y มากกว่า z หรือไม่? : ', x>y>z)

#ในกรณี หรือ ถ้าเคสใดเคสนึงถูกก็ตอบถูก ถ้าผิดหมดก็ False
#ในกรณี และ ถ้าเคสใดเคสนึงผิด False ถึงมีถูกก็ false
